УТ_для_edt/src/InformationRegisters/смартИсторияИзмененияРазрешений/смартИсторияИзмененияРазрешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИсторияИзмененияРазрешений</name>
  <comment>//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов</comment>
  <resources>
    <name>Разрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартИсторияИзмененияРазрешений/ManagerModule.bsl
#Область Интерфейс

Функция ЗаписатьРазрешениеВИсторию(Документ, ДопПараметры = Неопределено, ВидРазрешения, Разрешено, ИДЗаписи = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИДЗаписи = Неопределено Тогда
		ИДЗаписи = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	рег = РегистрыСведений.смартИсторияИзмененияРазрешений.СоздатьНаборЗаписей();
	рег.Отбор.Документ.Установить(Документ, Истина);
	рег.Отбор.ИД.Установить(ИДЗаписи, Истина);
	рег.Отбор.ВидРазрешения.Установить(ВидРазрешения, Истина);
	
	Запись = рег.Добавить();
	Запись.Документ = Документ;
	Запись.ИД = ИДЗаписи;
	Запись.ВидРазрешения = ВидРазрешения;
	Запись.Разрешено = Разрешено;
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Ответственный = Пользователи.АвторизованныйПользователь();
	
	Если НЕ ДопПараметры = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Запись, ДопПараметры);
	КонецЕсли;
	
	рег.ОбменДанными.Загрузка = Истина;
	рег.Записать(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ИДЗаписи;
	
КонецФункции

Функция ПолучитьИнформациюОПоследнемРазрешении(Документ, ВидРазрешения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.смартИсторияИзмененияРазрешений КАК смартИсторияИзмененияРазрешений
	|ГДЕ
	|	смартИсторияИзмененияРазрешений.Документ = &Документ
	|	И смартИсторияИзмененияРазрешений.ВидРазрешения = &ВидРазрешения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИзменения УБЫВ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ВидРазрешения", ВидРазрешения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьИнформациюПоРазрешению(Документ, ИД, ВидРазрешения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.смартИсторияИзмененияРазрешений КАК смартИсторияИзмененияРазрешений
	|ГДЕ
	|	смартИсторияИзмененияРазрешений.Документ = &Документ
	|	И смартИсторияИзмененияРазрешений.ИД = &ИД
	|	И смартИсторияИзмененияРазрешений.ВидРазрешения = &ВидРазрешения";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ИД", ИД);
	Запрос.УстановитьПараметр("ВидРазрешения", ВидРазрешения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
